---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
source: html/4666641f-b340-1a3a-c27b-10d65ea858b2.htm
---
# RebarShapeConstraint180DegreeBendRadius Members

Create a 180-degree bend constraint driven by radius.